---
kind: type
id: T:Autodesk.Revit.DB.Visual.CommonSharedAssetType
source: html/99dd9f58-e8a9-ca63-a19a-45ab8b271923.htm
---
# Autodesk.Revit.DB.Visual.CommonSharedAssetType

The enumerated type representing the permitted values for the asset property "CommonSharedAsset" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public enum CommonSharedAssetType
```